/**
 *基础算法：各种排序算法，深度优先、广度优先、二分查找、递归
 *算法思想：递归、分治、二分查找、贪心算法、回溯、动态规划、枚举/暴力
 *基础数据结构和算法的实现：如堆、二叉树、图•
 *基础数据结构的使用：如链表、栈、队列、哈希表、图、Trie、并查集.

 插冒归，他很稳
 插冒归喜欢选冒插，查完就慌(方)了
 快归堆，n老了

 分治，顾名思义，
 就是 分而治之 ，将一个复杂的问题，
 分成两个或多个相似的子问题，在把子问题分成更小的子问题，
 直到更小的子问题可以简单求解，求解子问题，
 则原问题的解则为阿子问题解的合并。
 */

/**
 * 冒泡排序
 *
 * 思路
 * 每次比较相邻的两个元素，前一个比后一个小，位置不动，前一个比后一个大，交换位置；
 * 最大的再最后面
 * 最后一个数不用比较，因为第一个数已经是最大的
 * 暴力法，比较连续的两个数，分别用下标表示
 * 第一轮比完，找到最大的一个数
 * 第二轮比完，找到最大的第二个数，
 * 以此类推，所以第每次循环只需要比较 len - 1 - i 个长度的数
 *
 * 自己的理解
 * 每次比较其实总长度没有变，只是找到这一轮中最大的数
 * 所以剩下的数还是要从头比较，从剩下的数中进行两两比较，因此需要比较 len - 1 个数，
 * 内存进行两两比较，找到最大的数；
 * 外层决定剩下的数的长度范围；
 *
 */
// 测试数组
let arr = [3, 38, 5, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48];

function maopaopaixu(arr) {
  let len = arr.length;
  // 外层循环得到循环次顺，就知道已经有多少个数已经排序，控制比较的轮数
  // 从后向前取数据，后面已经有多少个还未排序
  // 采用倒序遍历，节约循环次数（假设最坏的情况，数列倒序排列的）
  for (let i = len - 1; i > 0; i--) {
    // 内层进行两两比较，从开始到已排序之前的第一个元素
    for (let j = 0; j < i; j++) {
      if (arr[j] > arr[j + 1]) {
        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
      }
    }
  }
  console.log(arr);
}

/**
 * 选择排序
 * 定义
 * 1、首先在未排序序列中找到最小（大）元素，存放到排序序列的起始位置。
 * 2、再从剩余未排序元素中继续寻找最小（大）元素，然后放到已排序序列的末尾。
 * 3、重复1,2直到数据排序
 *
 */
arr = [7, 3, 5, 8, 6, 7, 4, 5, 19, 30, 40, 5];
function xuanzepaixu(a) {
  let len = a.length;
  // 每次假定未排序的第一个元素是最小值
  for (let i = 0; i < len; i++) {
    let minIndex = i;
    // 找出剩余数组中的最小值
    for (let j = i + 1; j < len; j++) {
      // 这样写可以只是交换数据过于频繁，
      // if(arr[j]<min){
      //     min=a[j];
      //     [a[i],a[j]] = [a[j],a[i]]
      // }
      // 优化
      // 找到最小值
      if (arr[j] < a[minIndex]) {
        minIndex = j;
      }
    }
    // 每一轮找到最小值后，进行位置交换，将最小值换到最前面
    [a[i], a[minIndex]] = [a[minIndex], a[i]];
  }
}

/**
 * 插入排序
 * 1、将第一个元素当做已经排序的数列
 * 2、从未排序的数列中选择一个和已经排序的数列中的数据进行对比，在已经排序的数列中找到合适的位置放下
 * 3、重复1,2步骤到结束
 */
arr = [78, 3, 38, 0, 67, 5, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48];
function charupaixu(a) {
  const len = a.length;
  for (let i = 1; i < len; i++) {
    let cur = a[i];
    let preIndex = i - 1;
    // // 每一个当前的数据都和之前的数据进行对比
    // // 当前数据小，当前数据向前移动，将之前的数据后移动,
    while (preIndex >= 0 && a[preIndex] > cur) {
      // 比当前数据小的数向后移动
      a[preIndex + 1] = a[preIndex];
      // 下标前移，对比完所有的之前的元素
      preIndex = preIndex - 1;
    }
    // 直到遇到比他小的，插入到小的后面
    a[preIndex + 1] = cur;
  }
}

let arr1 = [
  22, 34, 3, 32, 82, 55, 89, 50, 37, 5, 64, 100, 9, 70, 3, 38, 5, 47, 15, 36,
  26, 27, 2, 46, 4, 19, 50, 48,
];
// arr = [7, 3, 5, 8, 6, 7, 4, 5, 19, 30, 40, 5];
let arr2 = [3, 38, 5, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48];
/**
 * 归并排序 算法复杂度 O(nlogn)
 * 1、将数组从中间进行分割成左右2部分
 * 2、将左右两部分重复步骤1，直到左右数组都只剩下一个元素，直接返回剩余的一个元素，加入到新的数组中；
 * 3、比较左右2部分，小的插入到新的数组中，比较完毕后，看左右数组是否还有剩余，有剩余的部分直接插入到数组尾部
 * 4、重复1,2,3 步骤直到比较完毕
 */

function mergeSort(arr = []) {
  // 数组分割只剩一个数据直接返回
  if (arr.length < 2) {
    return arr;
  }
  // 从中间分割数组
  let mid = Math.floor(arr.length / 2);
  // 左半部分
  let left = arr.slice(0, mid);
  // 右半部分
  let right = arr.slice(mid);
  // 假设左右任一一部分已经分到只剩下一个元素，直接合并
  return mergeArr(mergeSort(left), mergeSort(right));
}

// 合并左右2部分
function mergeArr(left = [], right = []) {
  let newArr = [];
  while (left.length && right.length) {
    if (left[0] <= right[0]) {
      // 取出第一个元素插入到新的数组中
      // 此处用 shift 好处是返回了第一个元素的同时，减少了元素的长度
      newArr.push(left.shift());
    } else {
      newArr.push(right.shift());
    }
  }
  // 先进行左边判断，再进行右边判断
  // 左边有剩余，左边添加到新数组
  while (left.length > 0) {
    newArr.push(left.shift());
  }

  // 右边有剩余，右边添加到新数组
  while (right.length > 0) {
    newArr.push(right.shift());
  }
  return newArr;
}

arr1 = [
  22, 34, 3, 32, 82, 55, 89, 50, 37, 5, 64, 100, 9, 70, 3, 38, 5, 47, 15, 36,
  26, 27, 2, 46, 4, 19, 50, 48,
];
// arr = [7, 3, 5, 8, 6, 7, 4, 5, 19, 30, 40, 5];
arr2 = [3, 38, 5, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48];
/**
 * 快速排序
 * 时间复杂度 O(nlogn)
 * 1、找一个基准（此处以数组的中间数为基准）；
 * 2、将大于基准的放在基准的左边数组中，小于基准的放在基准的右边数组中；
 * 2、将左边的数组和右边的数组不断重重复1,2步骤，直到数组中的元素只有一个；
 */

function kuaisupaixu(arr) {
  if (arr.length <= 1) {
    return arr;
  }
  // 基准数
  let mid = Math.floor(arr.length / 2);
  let pivot = arr[mid];
  // 去掉中间数，重新获取长度，让中间数和剩余的数进行对比
  arr.splice(mid, 1);
  // 左右数组用于分别存储小于基准的数，大于基准的数
  let left = [];
  let right = [];

  // 找到大于和小于基准的数
  for (let i = 0; i < arr.length; i++) {
    let ele = arr[i];
    if (ele > pivot) {
      right.push(ele);
    } else {
      left.push(ele);
    }
  }
  left = kuaisupaixu(left);
  right = kuaisupaixu(right);
  return [...left, pivot, ...right];
}
